#include <stdio.h>

int main()
{
    printf("123\n"); // подзадание 1

    printf("1\n2\n3\n"); // подзадание 2

    printf("1\n\t2\n\t\t3\n"); // подзадание 3

    printf("%1d\n%2d\n%3d\n%4d\n", 1, 2, 3, 4); // подзадание 4

    printf("%10.3f\n", 12.234657); // подзадание 5

    printf("%10.5f\n", 12.234657); // подзадание 6

    printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5%2); // подзадание 7

    printf("7 разделить на 5 равно %.2f\n", 7./5.); // подзадание 8

    printf("2000 умножить на 4 равно %d\n", 2000*4); // подзадание 9

    printf("%g разделить %e равно %f\n", 5., 2000000.0, 5./2000000); // подзадание 10

    printf ("%d разделить %d равно %d\n ",5, 2000000, 5/2000000);  // все спецификаторы d

    printf("%f разделить %f равно %f\n", 5., 2000000., 5./2000000); // все f

    printf("%g разделить %g равно %g\n", 5., 2000000., 5./2000000); // g

    printf ("%e разделить %e равно %f\n ",5., 2000000., 5./2000000);

    return 0;
}