#include <stdio.h>

void name() {
    puts("********************************************************");
    puts("*                                                      *");
    puts("*      Тема: Разработка консольного приложения         *");
    puts("*                                                      *");
    puts("* Группа: БИПТ-251                                     *");
    puts("* Выполнил: Сафонов Павел                              *");
    puts("*                                                      *");
    puts("********************************************************");
}

int main() {
    name();
    return 0;
}
